{"availability":{"units":[{"beds":1,"baths":1,"min_rent":1304,"max_rent":1304,"min_sqft":482,"max_sqft":482,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]},{"beds":1,"baths":1,"min_rent":1304,"max_rent":1304,"min_sqft":485,"max_sqft":485,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]},{"beds":2,"baths":1,"min_rent":1543,"max_rent":1543,"min_sqft":833,"max_sqft":833,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]},{"beds":1,"baths":1,"min_rent":1304,"max_rent":1304,"min_sqft":481,"max_sqft":481,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]},{"beds":1,"baths":1,"min_rent":1304,"max_rent":1304,"min_sqft":482,"max_sqft":482,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]},{"beds":1,"baths":1,"min_rent":1304,"max_rent":1304,"min_sqft":481,"max_sqft":481,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]},{"beds":1,"baths":1,"min_rent":1304,"max_rent":1304,"min_sqft":475,"max_sqft":475,"min_deposit":0,"max_deposit":0,"is_affordable":false,"available":true,"available_on":null,"pricing":[]}]},"preleasing_date":null,"apt_feature_custom_texts":{"internet":"The units are wired for internet.","paid_utilities":"Rent includes water, sewer, and trash. Electricity is the responsibility of the resident.","parking":"Parking is unassigned. There are a limited number of garage parking spots that are available on a \"first come, first serve\" basis.","pet_breed_restrictions":"","fitness":"","lease_length":"Our community offers a minimum lease term of 12 calendar months. ","kitchen_features":"Our amenity-packed kitchens boast refrigerators and ranges to help you cook up any sized feast.","controlled_access":"","balcony":"","pool":"","flooring":"Vinyl wood-style flooring and carpet are featured in your new home for easy maintenance and cleaning.","tennis_court":""},"apt_features":[{"name":"emergency_maintenance","choices":["yes"]},{"name":"balcony","choices":["none"]},{"name":"bike_storage","choices":["yes"]},{"name":"cable_ready","choices":["yes"]},{"name":"controlled_access","choices":["yes"]},{"name":"flooring","choices":["carpet","wood_style"]},{"name":"furnished_units","choices":["no"]},{"name":"gated_community","choices":["na"]},{"name":"kitchen_features","choices":["range","refrigerator"]},{"name":"laundry","choices":["on_site"]},{"name":"lease_length","choices":["12_months"]},{"name":"smoke_free","choices":["all"]},{"name":"tennis_court","choices":["na"]},{"name":"pet_breed_restrictions","choices":["no"]},{"name":"pet_perks","choices":["dog_park"]},{"name":"pool","choices":[]},{"name":"paid_utilities","choices":["some"]},{"name":"internet","choices":["cable"]},{"name":"parking","choices":["garage","parking_lot"]}],"custom_responses":[{"title":"Amenities","response":"Halewai`olu Senior Residences offers a 4th floor private outdoor pet park, activity rooms, a bike rack, business center, community garden, fitness loop, full-time resident services coordinator, multipurpose room with a warm kitchen and air conditioning in every unit!"},{"title":"Features to highlight","response":"Our brand-new apartments have amazing views of Oahu's south shore and air conditioning in every unit!"},{"title":"Income & Rental Requirements","response":"We offer affordable senior apartment homes, meaning applicants who apply must meet both income and age criteria to be accepted. ::next::Qualified applicants must be 55 years or older, and must have income equaling 2 times the monthly rent. Maximum income by household are as follows: 1 person/$73,360, 2 people/$83,840, 3 people/$94,320, 4 people/$104,800 ::next::Our occupancy standards allow for 2 per bedroom plus 1."},{"title":"Deposit","response":"Our rental deposit is equal to one month's rent. ::next:: If you have questions on a rental deposit refund, please speak to a leasing agent directly."},{"title":"Air Conditioning","response":"Every apartment comes standard with air conditioning!"},{"title":"Apartment Interior","response":"In addition to an amazing kitchen, our apartment homes boast vaulted ceilings, spacious closets, and blinds meant to create the perfect open and airy experience for our residents. ::next:: When compared to other senior communities, we made sure to consider every situation no matter if you still work full-time, part-time or are completely retired. You'll find the perfect balance of space and functionality."},{"title":"Pool & Spa","response":"Unfortunately, we do not have a pool or hot tub at our community. While the Ala Moana Beach Park is within two miles for a salty swim, residents also have access to several nearby public swimming pool options available to them."},{"title":"Golf Course","response":"While we do not have a golf course adjacent to our community, there are several options within driving distance including the Walter J Nagorski Golf Course, Oahu Country Club, and Moanalua Golf Club."},{"title":"Social Media","response":"Don't forget to like and follow our community on [Facebook](https://www.facebook.com/profile.php?id=100092001421887) to keep up to date on announcements and future events."},{"title":"Controlled Access","response":"Our community is controlled access, but we do not provide security, alarms, or smart access for individual units. Our apartments are keyed access only."},{"title":"Laundry","response":"We have a couple of laundry options available to meet your unique needs, including a 24/7 on-site facility and in-home washer and dryer hook ups. ::next:: Maybe you prefer to send your wash out? Your chosen vendor may pick-up and deliver right to your door for added convenience."},{"title":"Residents","response":"Residents have access to a convenient [portal](https://property.onesite.realpage.com/welcomehome/home/login?siteId=5119067#url=%23login) where you can pay rent, send requests to the office, and review the community policies. ::next:: When it comes to everything else, our committed leasing team is here to help answer any question or address any concern that you have."},{"title":"Lock Outs","response":"If you happen to find yourself locked out of your home and it is during business hours, contact the office and a leasing agent will be happy to assist. ::next::However, if you are locked out after business hours you will either need to wait until the next business day or contact a local locksmith to gain entry to your home."},{"title":"Management","response":"The Michaels Organization professionally manages our community. The team is on-site during posted business hours. Don't forget to program the property number, 808-808-1331, on your phone once you move in."},{"title":"Delivery Policy","response":"Whether it's for grocery, dry cleaning, or parcels, residents are able to provide access to delivery drivers so that they can enter our controlled access community and come straight to your home to drop off your items. ::next::We do offer USPS and package lockers for added convenience."},{"title":"Website","response":"Visit us online at liveathsr.com to access photos, application details, and amenities."},{"title":"Sales","response":"Unfortunately, our community is rental only. We do not have any homes for sale."},{"title":"Trash","response":"Trash collection is included in the monthly rent, however refuse must be delivered to a central location for pick-up. We do not offer a valet trash service at this time. ::next::If you are interested in recycling, while it is not planned, we of course strongly encourage you to engage in recycling using a public use facility in our area."},{"title":"Sublets","response":"We will not be allowing subleasing. If you need to learn more about your contract, please contact a leasing agent to discuss any available options."},{"title":"Resident Referral","response":"A ringing endorsement of any Michaels Organization community is always greatly appreciated, but unfortunately we do not offer any resident referral incentives at this time."},{"title":"Renters Insurance","response":"Renter's Insurance is a great asset to any resident. You should always make certain to protect your personal effects. While it is not required, it is highly recommended."},{"title":"Elevators","response":"Yes, we have elevators throughout the property for added convenience."},{"title":"Fair Housing","response":"Our community, along with our other sister properties nationwide, comply with all fair housing laws."},{"title":"Airport","response":"We are located just a few miles from the Honolulu International Airport."},{"title":"Accessible","response":"We offer accessible apartment homes amongst our standard floorplan options. A member of our leasing team would be happy to provide additional details."},{"title":"Fireplace","response":"We do not feature fireplaces in any of our apartment homes."},{"title":"Corporate","response":"This community does not offer corporate, or short term, housing at this time."},{"title":"Accent Walls","response":"We encourage residents to personalize their homes, but suggest decorating with items such as art or plants to brighten up your space. For larger projects like painting an accent wall in your apartment, approval from the community manager is first required."},{"title":"Charging Station","response":"We do not offer on-site charging stations for electric vehicles."},{"title":"Concierge","response":"We do not have a concierge service, but feel free to ask your friendly on-site management team for any assistance you need."},{"title":"Cosigner","response":"Our credit screening is flexible, but should you need a cosigner to qualify, we accept OneApp Guarantee and will present this option if needed during your application submission."},{"title":"HOA","response":"We do not charge any HOA or maintenance fees to our residents."},{"title":"Library","response":"We do not have an on-site library, but the amazing Liliha Public Library is just down the road from our community,"},{"title":"Penthouse","response":"We do not offer any penthouse apartment homes."},{"title":"Playground","response":"Sorry, but we do not have an on-site playground for when the little ones come to visit. There are several great parks in the neighborhood we'd suggest checking out instead."},{"title":"Private Yard","response":"Our apartment homes do not come with a private yard per residence, but feel free to enjoy the common outdoor spaces throughout our community."},{"title":"Sports Courts","response":"While we do not have any tennis courts, there are quite a few nearby recreation centers and public parks available for use."},{"title":"Section 8","response":"Section 8 recipients are warmly welcomed here - inquire today about our available units."},{"title":"Fees","response":"We are currently waiving our application fee! We do have a pet fee of $350. Our security deposit is equal to one months rent. "},{"title":"Affordable Community","response":"We are an affordable housing provider!"},{"title":"Application qualification","response":"Applicants are screened for credit, criminal, and evictions search. Minimum and maximum income limits apply."},{"title":"Leasing ","response":"We are currently leasing! Please feel free to ask more questions about the property to learn more. "}],"special_offer":[{"description":"$99 Security Deposit, ONE FREE MONTH AND NO APPLICATION FEE FOR ONE & TWO BEDROOM APARTMENTS","startDate":"2024-04-08T04:00:00.000Z","expirationDate":"2024-05-31T04:00:00.000Z"}],"leasing_application_url":"https://8979750aff.onlineleasing.realpage.com/#k=20748"}